DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleCaptivePortalProbe() {
  if (setupMode) {
    webServer.send(200, "text/html; charset=utf-8", setupPageHTML());
    return;
  }
  redirectToSetupRoot();
}

void handleSaveWifi() {
  String ssid = webServer.arg("custom_ssid");
  ssid.trim();
  if (ssid.length() == 0) {
    ssid = webServer.arg("ssid");
    ssid.trim();
  }
  String password = webServer.arg("password");
  if (ssid.length() == 0) {
    webServer.send(400, "text/plain; charset=utf-8", "SSID fehlt");
    return;
  }
  if (ssid.length() >= kWifiSsidBytes || password.length() >= kWifiPasswordBytes) {
    webServer.send(400, "text/plain; charset=utf-8", "SSID or password is too long");
    return;
  }

  saveWifiCredentials(ssid, password);
  Serial.printf("wifi_credentials_saved ssid=%s\n", ssid.c_str());
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>Saved. Vibe TV is restarting.</p>");
  delay(500);
  ESP.restart();
}

void handleResetWifi() {
  if (webServer.method() != HTTP_POST) {
    webServer.send(405, "text/plain; charset=utf-8", "method not allowed");
    return;
  }

  clearWifiCredentials();
  clearBootRecoveryCounter();
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  ESP.restart();
}

void handleHello() {
  webServer.send(200, "application/json", codexbar_display::app::BuildDeviceHelloJSON(makeTransportConfig("wifi")));
}

String wifiModeName() {
  switch (WiFi.getMode()) {
    case WIFI_OFF:
      return "off";
    case WIFI_STA:
      return "station";
    case WIFI_AP:
      return "access_point";
    case WIFI_AP_STA:
      return "ap_station";
    default:
      return "unknown";
  }
}

bool isSafeAssetPath(const String& path) {
  if (path.length() == 0 || path.length() >= kMaxAssetPathBytes || path.charAt(0) != '/') {
    return false;
  }
  if (path.indexOf("..") >= 0 || path.indexOf("//") >= 0) {
    return false;
  }
  if (path.endsWith("/")) {
    return false;
  }
  for (size_t i = 0; i < path.length(); ++i) {
    const char c = path.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '/' || c == '-' || c == '_' || c == '.';
    if (!ok) {
      return false;
    }
  }
  return true;
}

bool ensureAssetParentDirs(const String& path) {
  int slash = path.indexOf('/', 1);
  while (slash > 0) {
    const String dir = path.substring(0, slash);
    if (dir.length() > 1 && !LittleFS.exists(dir)) {
      if (!LittleFS.mkdir(dir)) {
        return false;
      }
    }
    slash = path.indexOf('/', slash + 1);
  }
  return true;
}

bool filesystemInfoJSON(String& out) {
  const bool mounted = LittleFS.begin();

  out += "\"filesystem\":{\"mounted\":";
  out += mounted ? "true" : "false";
  out += "}";
  return mounted;
}

void appendRendererDebugJSON(String& out) {
  const codexbar_display::esp8266::RendererDebugSnapshot snapshot = renderer.DebugSnapshot();
  out += "\"display\":{\"activeTheme\":\"";
  out += jsonEscape(snapshot.activeTheme);
  out += "\",\"gif\":{\"activePath\":\"";
  out += jsonEscape(snapshot.gifActivePath);
  out += "\",\"filePresent\":";
  out += snapshot.gifFilePresent ? "true" : "false";
  out += ",\"fileOpen\":";
  out += snapshot.gifFileOpen ? "true" : "false";
  out += ",\"decoderOpen\":";
  out += snapshot.gifDecoderOpen ? "true" : "false";
  out += ",\"blocked\":";
  out += snapshot.gifBlocked ? "true" : "false";
  out += ",\"consecutiveFailures\":";
  out += String(snapshot.gifConsecutiveFailures);
  out += ",\"backoffRemainingMs\":";
  out += String(snapshot.gifBackoffRemainingMs);
  out += ",\"lastError\":";
  if (snapshot.gifLastErrorStage.length() == 0) {
    out += "null";
  } else {
    out += "{\"path\":\"";
    out += jsonEscape(snapshot.gifLastErrorPath);
    out += "\",\"stage\":\"";
    out += jsonEscape(snapshot.gifLastErrorStage);
    out += "\",\"failures\":";
    out += String(snapshot.gifLastErrorFailures);
    out += ",\"ageMs\":";
    out += String(snapshot.gifLastErrorAgeMs);
    out += "}";
  }
  out += "}}";
}

void appendAssetEntriesJSON(String& out, const String& dirPath, bool& first, uint8_t depth) {
  if (depth > 4) {
    return;
  }
  Dir dir = LittleFS.openDir(dirPath);
  while (dir.next()) {
    String path = dir.fileName();
    if (!path.startsWith("/")) {
      path = "/" + path;
    }
    if (dir.isDirectory()) {
      appendAssetEntriesJSON(out, path, first, depth + 1);
      continue;
    }
    if (!first) {
      out += ",";
    }
    first = false;
    out += "{\"path\":\"";
    out += jsonEscape(path);
    out += "\",\"sizeBytes\":";
    out += String(dir.fileSize());
    String sha256;
    if (sha256FileHex(path, sha256)) {
      out += ",\"sha256\":\"";
      out += sha256;
      out += "\"";
    } else {
      out += ",\"sha256\":null,\"hashError\":\"read_failed\"";
    }
    out += "}";
  }
}

void appendAssetListJSON(String& out) {
  out += "\"assets\":[";
  bool first = true;
  if (LittleFS.begin()) {
    appendAssetEntriesJSON(out, "/", first, 0);
  }
  out += "]";
}

void handleHealth() {
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String out;
  out.reserve(900);
  out += "{\"ok\":true";
  out += ",\"firmware\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_FW_VERSION);
  out += "\",\"board\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_BOARD_ID);
  out += "\",\"wifi\":{\"mode\":\"";
  out += wifiModeName();
  out += "\",\"connected\":";
  out += wifiConnected ? "true" : "false";
  out += ",\"ip\":\"";
  out += wifiConnected ? WiFi.localIP().toString() : "";
  out += "\",\"softApIp\":\"";
  out += (setupMode || WiFi.getMode() == WIFI_AP || WiFi.getMode() == WIFI_AP_STA) ? WiFi.softAPIP().toString() : "";
  out += "\",\"rssi\":";
  out += wifiConnected ? String(WiFi.RSSI()) : "0";
  out += "},";
  const bool filesystemMounted = filesystemInfoJSON(out);
  out += ",";
  appendRendererDebugJSON(out);
  out += ",\"transport\":{\"active\":\"wifi\",\"supported\":[\"usb\",\"wifi\"],\"httpPort\":80,\"maxFrameBytes\":";
  out += String(kMaxFrameBytes);
  out += "}}";

  Serial.printf("health_requested ip=%s fs_mounted=%d\n", webServer.client().remoteIP().toString().c_str(), filesystemMounted ? 1 : 0);
  webServer.send(200, "application/json", out);
}

void handleAssetsList() {
  String out;
  out.reserve(1200);
  out += "{";
  (void)filesystemInfoJSON(out);
  out += ",";
  appendAssetListJSON(out);
  out += "}";
  webServer.send(200, "application/json", out);
}

void setAssetUploadError(const String& message) {
  assetUploadError = message;
  Serial.printf("asset_upload_error path=%s message=%s\n", assetUploadPath.c_str(), assetUploadError.c_str());
}

String requestedAssetPath() {
  String path = webServer.arg("path");
  path.trim();
  if (path.length() == 0) {
    path = webServer.upload().filename;
    path.trim();
    const int lastSlash = path.lastIndexOf('/');
    if (lastSlash >= 0) {
      path = path.substring(lastSlash + 1);
    }
    const int lastBackslash = path.lastIndexOf('\\');
    if (lastBackslash >= 0) {
      path = path.substring(lastBackslash + 1);
    }
    if (path.length() > 0 && !path.startsWith("/")) {
      path = "/" + path;
    }
  }
  return path;
}

